# SectionShowInOneViewOnly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SectionShowInOneViewOnly Property
ParameterTypeId Class See Also
---
"Show in"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SectionShowInOneViewOnly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SectionShowInOneViewOnly As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SectionShowInOneViewOnly {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace